{"extracted_information": "The Instagram post from @veggie_naplavka announces that the @nech_me_rust sanctuary will be present at the Veggie Náplavka event. The post expresses happiness about their participation. @nech_me_rust is described as a sanctuary caring for 80 animals in beautiful nature, operating on 'family farm principles'. The post recommends viewers check out @nech_me_rust's Instagram videos showing them walking with animals in the forest, and suggests that visitors might be able to visit the sanctuary in person for a walk. Attendees at Veggie Náplavka can support the sanctuary by purchasing homemade products such as herbal teas, spices, oils, and herbal ointments. The post includes hashtags like #veggienaplavka, #veganfighter, #nechmerust, #zvirata (animals), #vegan, #prague, #praha, #event, #veganevent, #veganfoodevent, #veganstvi (veganism), and #rostlinnastrava (plant-based diet).\n\nComments include a user (@tinuu_skaa) asking about a physical shop, expressing love for the animals and products, and a reply from @nech_me_rust thanking @veggie_naplavka for the introduction and expressing their anticipation for the event.", "specifications": {}, "pricing": {}, "features": [{"name": "Sanctuary Presence", "description": "The @nech_me_rust sanctuary will be present at the Veggie Náplavka event."}, {"name": "Animal Care", "description": "The sanctuary cares for 80 animals based on family farm principles in a natural setting."}, {"name": "Product Sales", "description": "Homemade products will be available for purchase to support the sanctuary, including herbal teas, spices, oils, and herbal ointments."}, {"name": "Engagement Invitation", "description": "Viewers are encouraged to watch @nech_me_rust's Instagram videos and potentially visit the sanctuary in person for a walk."}], "statistics": {"animals_cared_for_by_sanctuary": 80}, "temporal_info": {"post_date": "April 20, 2024"}, "geographical_data": {"location": "Rašínovo nábřeží, Prague", "city": "Prague", "country": "Czech Republic"}, "references": ["@nech_me_rust", "@veggie_naplavka", "@vegan_fighter"]}